<style lang="scss">
    $prfClass: 'protocols';
    .#{$prfClass}-wrap{
        margin: 22px auto 0px;
        width: 920px;
        background: #fff;
        padding-bottom: 40px;
        h3{
            padding-top: 59px;
            font-size: 26px;
            color: #429EFD;
            font-family:MicrosoftYaHei-Bold;
            font-weight:bold;
            text-align: center;
        }
        .tab{
            margin: 60px auto 22px;
            width:760px;
            height: 660px;
            overflow-x: hidden;
            overflow-y: auto;
            font-size:14px;
            color: #2F3032;
            font-weight: 400;
            .p_1{
                margin: 20px 0px;
            }
            .p_2{
                margin-top: 20px;
            }
            .p_3{
                margin-top: 10px;
            }
        }
        .tab p{
            text-align: left;
            line-height: 28px;
        }

        .agree{
            text-align: left;
            width: 760px;
            margin: 0 auto;
        }
        .btn{
            text-align: left;
            width: 760px;
            margin: 30px auto 0px;
            .btn_agree, .btn_not_agree{
                width:160px;
                height:44px;
            }
            .btn_not_agree{
                margin-left: 16px;
                color: #429EFD;
                border-radius:5px;
                border:1px solid rgba(66,158,253,1);
            }
        }
        .isAgree{
            margin: 5px 0px;
            color: red;
        }
    }
</style>
<template>
    <div :class="prfClass">
        <common-header></common-header>
        <div :class="[prfClass + '-wrap']">
            <h3>力达物流资源平台服务协议</h3>
            <div class="tab">
                <p>版本生效日期：2018年10月16日</p>
                <p>提示条款</p>
                <p class="p_1">欢迎您使用力达物流资源平台服务！</p>
                <p class="p_1">本协议是您与“力达物流资源平台”（下称“本网站”）所有者（以下简称“力达”）之间订立的契约，请您仔细阅读本协议各条款内容，一经您点击“我已仔细阅读并同意以上服务协议”按键，即意味着您同意与本网站所有者签订本协议并同意受本协议约束。</p>
                <p>一、 本协议的订立</p>
                <p>在本网站依据《力达物流资源平台服务协议》提交注册，且符合本网站招商标准的用户（下称“物流商”），在同意接受本协议全部条款后，方能使用“力达物流资源平台”（下称“入驻系统”） 申请入驻。一经物流商点击“我已仔细阅读并同意以上服务协议”按键，即意味着物流商同意与本网站所有者签订本协议并同意受本协议约束。</p>
                <p class="p_2">二、 入驻系统使用说明</p>
                <p>2.1 物流商通过入驻系统提出入驻申请，并按照要求填写物流商信息、提供物流商资质资料后，成功入驻后。由本网站审核并与有合作意向的物流商联系协商合作相关事宜，双方协商一致后线下签订《国际海运运输代理协议》、《国际航空运输代理协议》、《国际铁路运输代理协议》、《国际货物运输代理协议》《中港货物运输代理协议》《清关协议》等书面协议（以下简称“物流书面协议”），物流商可开始与“力达”进行后续合作。</p>
                <p class="p_3">2.2 物流商以及本网站通过入驻系统作出的申请、资料提交及确认等各类沟通，仅为双方合作的意向以及本网站对物流商资格审核的必备程序。双方间具体合作事宜及运营规则均以物流书面协议的约定及于“力达物流资源管理平台”公示的各项规则为准。</p>

                <p class="p_2">三、 物流商权利义务</p>
                <p>3.1 物流商应查看本网站公示的入驻物流商标准，并确保资质符合本网站公示的基本要求，物流商知悉并理解本网站将结合自身业务发展情况对物流商进行选择。</p>
                <p class="p_3">3.2 物流商应按照本网站要求诚信提供入驻申请所需资料并如实填写相关信息，物流商应确保提供的注册资料及信息真实、准确、完整、合法有效，如有变动，物流商应及时更新注册资料。经本网站审核通过后，物流商不得擅自修改替换相应资料及主要信息。如物流商提供的申请资料及信息不合法、不真实、不准确的，物流商需承担因此引起的相应责任及后果，并且本网站有权立即终止物流商使用入驻系统的权利。</p>
                <p class="p_3">3.3 物流商使用入驻系统提交的所有内容应不含有木马等软件病毒、政治宣传、或其他任何形式的“垃圾信息”、违法信息，且物流商应按本网站规则使用入驻系统，不得从事影响或可能影响本网站或入驻系统正常运营的行为，否则，本网站有权清除前述内容，并有权立即终止物流商使用入驻系统的权利。</p>
                <p class="p_3">3.4 物流商应注意查看入驻系统公示的入驻申请结果，如审核通过的物流商，则按照本网站工作人员的通知按要求办理入驻的相关手续；如审批未通过的物流商，则可自本网站通过入驻系统将审批结果告知物流商（需物流商登陆入驻系统查看）后提出异议并补充提供相关资料，如审批仍未通过的，则物流商同意提交的申请资料及信息本网站无需返还，由本网站自行处理。同时，本网站将终止物流商使用入驻系统的权利。</p>
                <p class="p_3">3.5 物流商应谨慎合理地保存、使用自己在本网站的用户名和密码，不得以任何形式擅自泄漏、转让或授权他人使用自己的用户名和密码，否则由此产生的不利后果均由物流商自行承担。同时，物流商应当对其以用户账号进行的所有的行为和事件负全部法律责任。</p>

                <p class="p_2">四、 本网站权利义务</p>
                <p class="p_3">4.1 本网站开发的入驻系统仅为物流商申请入驻的平台，物流商正式入驻后，将在物流商后台系统中进行相关操作。</p>
                <p class="p_3">4.2 本网站有权对物流商提供的资料及信息进行审核，并有权结合自身业务情况对合作物流商进行选择；本网站对物流商提交资料及信息的审核均不代表本网站对审核内容的真实、合法、准确、完整性作出的确认，物流商应对其提供资料及信息承担相应的法律责任。</p>
                <p class="p_3">4.3 无论物流商是否通过本网站的审核，本网站有权对物流商提供的资料及信息予以留存并随时查阅，同时，本网站有义务对物流商提供的资料予以保密，但国家行政机关、司法机关等国家机构调取资料的除外。</p>
                <p class="p_3">4.4 本网站会尽力维护本系统信息的安全，但法律规定的不可抗力，以及因为黑客入侵、计算机病毒侵入发作等原因造成物流商资料泄露、丢失、被盗用、被篡改的，本网站不承担任何责任。</p>
                <p class="p_3">4.5 本网站应在现有技术支持的基础上确保入驻系统的正常运营，尽量避免入驻系统服务的中断给物流商带来的不便。</p>

                <p class="p_2">五、 知识产权</p>
                <p class="p_3">5.1 本网站开发的入驻系统及其包含的各类信息，如文字、文章、图表、标识、广告、照片、按钮图标、图像、音频剪辑、数字下载、数据编辑等的知识产权归本网站所有者所有，受国家法律保护,本网站有权不时地对入驻系统的内容进行修改，并在入驻系统中公示，无须另行通知物流商。</p>
                <p class="p_3">5.2 在法律允许的最大限度范围内，本网站所有者对本协议及入驻系统涉及的内容拥有解释权。</p>
                <p class="p_3">5.3 物流商未经本网站所有者书面许可，不得擅自使用、非法全部或部分的复制、转载、抓取入驻系统中的信息，否则由此给本网站造成的损失，物流商应予以全部赔偿。</p>

                <p class="p_2">六、 个人信息的保护及授权</p>
                <p class="p_3">6.1 个人信息的保护</p>
                <p>本网站非常重视用户个人信息（即能够独立或与其他信息结合后识别用户身份的信息）的保护，在物流商使用本网站提供的服务时，物流商同意本网站按照在本网站上公布的隐私政策收集、存储、使用、披露和保护物流商的个人信息。</p>
                <p class="p_3">6.2 个人信息的授权</p>
                <p>当物流商使用本网站进行登录或其他操作的时候，服务器会自动接收、验证、并记录一些必要的信息，以保障物流商在使用本网站系统服务过程中的安全。物流商使用本网站系统服务，即表示物流商同意本网站可以按照相关的隐私政策处理物流商的个人信息。</p>

                <p class="p_2">七、 入驻系统服务的终止</p>
                <p class="p_3">7.1 物流商自行终止入驻申请，或物流商经本网站审批未通过的，则入驻系统服务自行终止。</p>
                <p class="p_3">7.2 物流商使用本网站或入驻系统时，如违反相关法律法规或者违反本协议规定的，本网站有权随时终止物流商使用入驻系统的权利。</p>

                <p class="p_2">八、 网站政策，变更和可分割性</p>
                <p class="p_3">本网站保留随时更改网站、政策和服务条款的权利。如果这些条款中的任何一条被认为是无效的，或因任何原因无法执行，则该条款应被视为是可分割的，且不影响其余条款的有效性和可执行性。</p>

                <p class="p_2">九、 本协议的完整性</p>
                <p class="p_3">本协议由协议正文及公布于本网站的各项规则、通知、公告等组成，本网站有权对本协议以及各个单项条款和公告实时更新，并予以公示。物流商在登录本网站时，应及时关注并遵守全部协议内容。</p>

                <p class="p_2">十、 法律管辖和适用</p>
                <p class="p_3">本协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规则）。如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。如双方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向协议签订地人民法院提起诉讼。本协议签订地为中华人民共和国深圳市南山区。</p>

            </div>
            <div class="agree">
                <el-checkbox @change="agreeChange" v-model="agreeType">我已阅读并同意遵守《力达物流资源管理系统平台服务协议》</el-checkbox>
                <div class="isAgree" v-show="isAgreeTips">请阅读并勾选</div>
            </div>
            <div class="btn">
                <el-button type="primary" @click="btn_agree" class="btn_agree">同意</el-button>
                <el-button plain @click="btn_not_agree" class="btn_not_agree">不同意</el-button>
            </div>
        </div>
    </div>
</template>

<script>
import CommonHeader from '../../components/commonHeader'

export default {
    name: 'protocols',
    components: {
        CommonHeader
    },
    data () {
        return {
            prfClass: 'protocols',
            form: {
                name: ''
            },
            agreeType: false,
            isAgreeTips: false
        }
    },
    methods: {
        // agreeChange 校验
        agreeChange () {
            if (this.agreeType) {
                this.isAgreeTips = false
            }
        },

        // 同意
        btn_agree () {
            if (this.agreeType) {
                this.$router.push({ path: '/register' })
            } else {
                this.isAgreeTips = true
            }
        },
        // 不同意
        btn_not_agree () {
            this.$router.push({ path: '/home' })
        }
    }
}
</script>
